{
  "backend/main.mo": "Motoko actor for a pharmacy backend exposing query functions for store info, categories, products by category, and product search, with hardcoded 'Sameer Medical' store details.",
  "backend/migration.mo": "Minimal migration module with empty old/new actor types and a no-op run function for schema migration support.",
  "feature_evidence.json": "Feature evidence report mapping two completed features—updating the pharmacy name and contact/hours info to 'Sameer Medical' values—to their affected frontend files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, serving as a reference index for the project's React components, pages, hooks, and config files.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark theme tokens including colors, borders, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point titled 'Medical Store Website' that mounts the React app via a root div and module script.",
  "frontend/src/App.tsx": "Sets up TanStack Router with a root layout (Header/Footer) and two routes: landing page (/) and products page (/products) with optional category search param.",
  "frontend/src/components/AboutUsSection.tsx": "Two-column About Us section displaying store description and contact info cards (address, phone, hours) with fallback defaults pointing to 'Sameer Medical' in Shahabad, Karnataka.",
  "frontend/src/components/CategoriesGrid.tsx": "Responsive 4-column grid of category cards with icons, color coding, loading skeletons, empty state, and links to the filtered products page.",
  "frontend/src/components/CategoryFilter.tsx": "Horizontal pill-button category filter with an 'All' option and active/inactive styling, used to filter products on the products page.",
  "frontend/src/components/FeaturedProducts.tsx": "Featured products section displaying up to 8 products in a responsive grid with loading skeletons, empty state, and a 'View All Products' link.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with store branding, quick navigation links, and contact info (address, phone, hours) sourced from optional StoreInfo props with fallback defaults.",
  "frontend/src/components/Header.tsx": "Sticky top navigation header with logo, desktop nav links, a 'Browse Products' CTA button, and a collapsible mobile menu.",
  "frontend/src/components/HeroSection.tsx": "Full-width hero banner with a background image, gradient overlay, store name/CTA buttons, and a quick-info bar showing phone, hours, and quality badge using StoreInfo data.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product's category, availability, name, description, and INR-formatted price in a styled card with hover effects.",
  "frontend/src/components/SearchBar.tsx": "Controlled search input component with a search icon and a clear (X) button that appears when the input has a value.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and login status state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks (useStoreInfo, useCategories, useProductsByCategory, useSearchProducts, useAllProducts) that fetch data from the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Inter, Plus Jakarta Sans), sets up Tailwind directives, and defines a medical-themed OKLCH color system with light and dark mode CSS variables.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider, then mounts it to the DOM.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component that fetches store info, categories, and products via React Query hooks and renders them through HeroSection, AboutUsSection, CategoriesGrid, and FeaturedProducts components.",
  "frontend/src/pages/ProductsPage.tsx": "Products listing page with debounced search, category filtering, and skeleton loading states, displaying filtered/searched products using data from multiple React Query hooks.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH-based color tokens, custom fonts (Inter/Plus Jakarta Sans), border radius variants, box shadows, and animation keyframes, with typography and container-queries plugins.",
  "project_state.json": "Project state tracking file describing Sameer Medical pharmacy website features, versioning, store details, and the status of implemented and pending feature requests."
}